/* # */
/* # ***** BEGIN LICENSE BLOCK ***** */
/* # Version: MPL 1.1/GPL 2.0/LGPL 2.1 */
/* # */
/* # The contents of this file are subject to the Mozilla Public License Version */
/* # 1.1 (the \"License\"); you may not use this file except in compliance with */
/* # the License. You may obtain a copy of the License at */
/* # http://www.mozilla.org/MPL/ */
/* # */
/* # Software distributed under the License is distributed on an \"AS IS\" basis, */
/* # WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License */
/* # for the specific language governing rights and limitations under the */
/* # License. */
/* # */
/* # The Original Code is mozilla.org code. */
/* # */
/* # The Initial Developer of the Original Code is */
/* # Netscape Communications Corporation. */
/* # Portions created by the Initial Developer are Copyright (C) 1998 */
/* # the Initial Developer. All Rights Reserved. */
/* # */
/* # Contributor(s): */
/* #   Javier Delgadillo <javi@netscape.com> */
/* #   Brian Ryner <bryner@brianryner.com> */
/* #   Terry Hayes <thayes@netscape.com> */
/* #   John Gardiner Myers <jgmyers@speakeasy.net> */
/* # */
/* # Alternatively, the contents of this file may be used under the terms of */
/* # either the GNU General Public License Version 2 or later (the \"GPL\"), or */
/* # the GNU Lesser General Public License Version 2.1 or later (the \"LGPL\"), */
/* # in which case the provisions of the GPL or the LGPL are applicable instead */
/* # of those above. If you wish to allow use of your version of this file only */
/* # under the terms of either the GPL or the LGPL, and not to allow others to */
/* # use your version of this file under the terms of the MPL, indicate your */
/* # decision by deleting the provisions above and replace them with the notice */
/* # and other provisions required by the GPL or the LGPL. If you do not delete */
/* # the provisions above, a recipient may use your version of this file under */
/* # the terms of any one of the MPL, the GPL or the LGPL. */
/* # */
/* # ***** END LICENSE BLOCK ***** */

"SignedBy" = "Authenticated by %S";
"CertPassPrompt" = "Please enter the master password for the %S.";
/* # the following strings have special requirements: */
/* # they must fit in a 32 or 64 byte buffer after being translated */
/* # to UTF8.  Note to translator. It’s not easy for you to figure */
/* # whether the escaped unicode string you produce will fit in  */
/* # the space allocated. */
/* # */
/* # 64 bytes long after conversion to UTF8 */
"RootCertModuleName" = "Builtin Roots Module";
/* # */
/* # 32 bytes long after conversion to UTF8 */
"ManufacturerID" = "Mozilla.org";
/* # */
/* # 32  bytes long after conversion to UTF8 */
"LibraryDescription" = "PSM Internal Crypto Services";
/* # */
/* # 32 bytes long after conversion to UTF8 */
"TokenDescription" = "Generic Crypto Services";
/* # */
/* # 32 bytes long after conversion to UTF8 */
"PrivateTokenDescription" = "Software Security Device";
/* # */
/* # 64 bytes long after conversion to UTF8 */
"SlotDescription" = "PSM Internal Cryptographic Services";
/* # */
/* # 64 bytes long after conversion to UTF8 */
"PrivateSlotDescription" = "PSM Private Keys";
/* # */
/* # 32 */
"Fips140TokenDescription" = "Software Security Device (FIPS)";
/* # 64 */
"Fips140SlotDescription" = "FIPS 140 Cryptographic, Key and Certificate Services";
/* # 32 */
"InternalToken" = "Software Security Device";
/* # End of size restriction. */
"VerifySSLClient" = "SSL Client Certificate";
"VerifySSLServer" = "SSL Server Certificate";
"VerifySSLStepUp" = "SSL Server with Step-up";
"VerifySSLCA" = "SSL Certificate Authority";
"VerifyEmailSigner" = "Email Signer Certificate";
"VerifyEmailRecip" = "Email Recipient Certificate";
"VerifyProtectObjSign" = "Protected Object Signer";
"VerifyObjSign" = "Object Signer";
"VerifyUserImport" = "User Import Cert";
"VerifyCAVerifier" = "CA Verifier";
"VerifyStatusResponder" = "Status Responder Certificate";
"VerifyAnyCA" = "Any Certificate Authority";
"HighGrade" = "High Grade";
"MediumGrade" = "Medium Grade";
/* # LOCALIZATION NOTE (nick_template): $1s is the common name from a cert (e.g. “Mozilla”), $2s is the CA name (e.g. VeriSign) */
"nick_template" = "%1$s’s %2$s ID";
/* #These are the strings set for the ASN1 objects in a certificate. */
"CertDumpCertificate" = "Certificate";
"CertDumpVersion" = "Version";
"CertDumpVersion1" = "Version 1";
"CertDumpVersion2" = "Version 2";
"CertDumpVersion3" = "Version 3";
"CertDumpSerialNo" = "Serial Number";
"CertDumpOID" = "Object Identifier";
"CertDumpMD2WithRSA" = "PKCS #1 MD2 With RSA Encryption";
"CertDumpMD5WithRSA" = "PKCS #1 MD5 With RSA Encryption";
"CertDumpSHA1WithRSA" = "PKCS #1 SHA-1 With RSA Encryption";
"CertDumpSHA256WithRSA" = "PKCS #1 SHA-256 With RSA Encryption";
"CertDumpSHA384WithRSA" = "PKCS #1 SHA-384 With RSA Encryption";
"CertDumpSHA512WithRSA" = "PKCS #1 SHA-512 With RSA Encryption";
"CertDumpDefOID" = "Object Identifier (%S)";
"CertDumpNULL" = "NULL";
"CertDumpIssuer" = "Issuer";
"CertDumpSubject" = "Subject";
"CertDumpRDN" = "Relative Distinguished Name";
"CertDumpATV" = "Attribute Type and Value";
"CertDumpAVACountry" = "C";
"CertDumpAVAState" = "ST";
"CertDumpAVALocality" = "L";
"CertDumpAVAOrg" = "O";
"CertDumpAVAOU" = "OU";
"CertDumpAVACN" = "CN";
"CertDumpUserID" = "UID";
"CertDumpPK9Email" = "E";
"CertDumpAVADN" = "DN";
"CertDumpAVADC" = "DC";
"CertDumpSurname" = "Surname";
"CertDumpGivenName" = "Given Name";
"CertDumpValidity" = "Validity";
"CertDumpNotBefore" = "Not Before";
"CertDumpNotAfter" = "Not After";
"CertDumpSPKI" = "Subject Public Key Info";
"CertDumpSPKIAlg" = "Subject Public Key Algorithm";
"CertDumpAlgID" = "Algorithm Identifier";
"CertDumpParams" = "Algorithm Parameters";
"CertDumpRSAEncr" = "PKCS #1 RSA Encryption";
"CertDumpRSATemplate" = "Modulus (%S bits):\n%S\nExponent (%S bits):\n%S";
"CertDumpECTemplate" = "Key size: %S bits\nBase point order length: %S bits\nPublic value:\n%S";
"CertDumpIssuerUniqueID" = "Issuer Unique ID";
"CertDumpSubjPubKey" = "Subject’s Public Key";
"CertDumpSubjectUniqueID" = "Subject Unique ID";
"CertDumpExtensions" = "Extensions";
"CertDumpCertType" = "Netscape Certificate Type";
"CertDumpNSCertExtBaseUrl" = "Netscape Certificate Extension Base URL";
"CertDumpNSCertExtRevocationUrl" = "Netscape Certificate Revocation URL";
"CertDumpNSCertExtCARevocationUrl" = "Netscape Certificate Authority Revocation URL";
"CertDumpNSCertExtCertRenewalUrl" = "Netscape Certificate Renewal URL";
"CertDumpNSCertExtCAPolicyUrl" = "Netscape Certificate Authority Policy URL";
"CertDumpNSCertExtSslServerName" = "Netscape Certificate SSL Server Name";
"CertDumpNSCertExtComment" = "Netscape Certificate Comment";
"CertDumpNSCertExtLostPasswordUrl" = "Netscape Lost Password URL";
"CertDumpNSCertExtCertRenewalTime" = "NetscapeCertificate Renewal Time";
"CertDumpNetscapeAolScreenname" = "AOL Screenname";
"CertDumpSubjectDirectoryAttr" = "Certificate Subject Directory Attributes";
"CertDumpSubjectKeyID" = "Certificate Subject Key ID";
"CertDumpKeyUsage" = "Certificate Key Usage";
"CertDumpSubjectAltName" = "Certificate Subject Alt Name";
"CertDumpIssuerAltName" = "Certificate Issuer Alt Name";
"CertDumpBasicConstraints" = "Certificate Basic Constraints";
"CertDumpNameConstraints" = "Certificate Name Constraints";
"CertDumpCrlDistPoints" = "CRL Distribution Points";
"CertDumpCertPolicies" = "Certificate Policies";
"CertDumpPolicyMappings" = "Certificate Policy Mappings";
"CertDumpPolicyConstraints" = "Certificate Policy Constraints";
"CertDumpAuthKeyID" = "Certificate Authority Key Identifier";
"CertDumpExtKeyUsage" = "Extended Key Usage";
"CertDumpAuthInfoAccess" = "Authority Information Access";
"CertDumpAnsiX9DsaSignature" = "ANSI X9.57 DSA Signature";
"CertDumpAnsiX9DsaSignatureWithSha1" = "ANSI X9.57 DSA Signature with SHA1 Digest";
"CertDumpAnsiX962ECDsaSignatureWithSha1" = "ANSI X9.62 ECDSA Signature with SHA1";
"CertDumpCertTypeEmail" = "Email";
"CertDumpEmailCA" = "Email Certificate Authority";
"CertDumpKUSign" = "Signing";
"CertDumpKUNonRep" = "Non-repudiation";
"CertDumpKUEnc" = "Key Encipherment";
"CertDumpKUDEnc" = "Data Encipherment";
"CertDumpKUKA" = "Key Agreement";
"CertDumpKUCertSign" = "Certificate Signer";
"CertDumpKUCRLSigner" = "CRL Signer";
"CertDumpCritical" = "Critical";
"CertDumpNonCritical" = "Not Critical";
"CertDumpSigAlg" = "Certificate Signature Algorithm";
"CertDumpCertSig" = "Certificate Signature Value";
"CertDumpExtensionFailure" = "Error: Unable to process extension";
"CertDumpIsCA" = "Is a Certificate Authority";
"CertDumpIsNotCA" = "Is not a Certificate Authority";
"CertDumpPathLen" = "Maximum number of intermediate CAs: %S";
"CertDumpPathLenUnlimited" = "unlimited";
"CertDumpEKU_1_3_6_1_5_5_7_3_1" = "TLS Web Server Authentication";
"CertDumpEKU_1_3_6_1_5_5_7_3_2" = "TLS Web Client Authentication";
"CertDumpEKU_1_3_6_1_5_5_7_3_3" = "Code Signing";
"CertDumpEKU_1_3_6_1_5_5_7_3_4" = "E-mail protection";
"CertDumpEKU_1_3_6_1_5_5_7_3_8" = "Time Stamping";
"CertDumpEKU_1_3_6_1_5_5_7_3_9" = "OCSP Signing";
"CertDumpEKU_1_3_6_1_4_1_311_2_1_21" = "Microsoft Individual Code Signing";
"CertDumpEKU_1_3_6_1_4_1_311_2_1_22" = "Microsoft Commercial Code Signing";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_1" = "Microsoft Trust List Signing";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_2" = "Microsoft Time Stamping";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_3" = "Microsoft Server Gated Crypto";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_4" = "Microsoft Encrypting File System";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_4_1" = "Microsoft File Recovery";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_5" = "Microsoft Windows Hardware Driver Verification";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_10" = "Microsoft Qualified Subordination";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_11" = "Microsoft Key Recovery";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_12" = "Microsoft Document Signing";
"CertDumpEKU_1_3_6_1_4_1_311_10_3_13" = "Microsoft Lifetime Signing";
"CertDumpEKU_1_3_6_1_4_1_311_20_2_2" = "Microsoft Smart Card Logon";
"CertDumpEKU_1_3_6_1_4_1_311_21_6" = "Microsoft Key Recovery Agent";
"CertDumpMSCerttype" = "Microsoft Certificate Template Name";
"CertDumpMSNTPrincipal" = "Microsoft Principal Name";
"CertDumpMSCAVersion" = "Microsoft CA Version";
"CertDumpMSDomainGUID" = "Microsoft Domain GUID";
"CertDumpEKU_2_16_840_1_113730_4_1" = "Netscape Server Gated Crypto";
"CertDumpRFC822Name" = "E-Mail Address";
"CertDumpDNSName" = "DNS Name";
"CertDumpX400Address" = "X.400 Address";
"CertDumpDirectoryName" = "X.500 Name";
"CertDumpEDIPartyName" = "EDI Party Name";
"CertDumpURI" = "URI";
"CertDumpIPAddress" = "IP Address";
"CertDumpRegisterID" = "Registered OID";
"CertDumpKeyID" = "Key ID";
"CertDumpVerisignNotices" = "Verisign User Notices";
"CertDumpUnused" = "Unused";
"CertDumpKeyCompromise" = "Key Compromise";
"CertDumpCACompromise" = "CA Compromise";
"CertDumpAffiliationChanged" = "Affiliation Changed";
"CertDumpSuperseded" = "Superseded";
"CertDumpCessation" = "Cessation of Operation";
"CertDumpHold" = "Certificate Hold";
"CertDumpOCSPResponder" = "OCSP";
"CertDumpCAIssuers" = "CA Issuers";
"CertDumpCPSPointer" = "Certification Practice Statement pointer";
"CertDumpPolicyOidEV" = "Extended Validation (EV) SSL Server Certificate";
"CertDumpUserNotice" = "User Notice";
"CertDumpLogotype" = "Logotype";
"CertDumpECPublicKey" = "Elliptic Curve Public Key";
"CertDumpECDSAWithSHA1" = "X9.62 ECDSA Signature with SHA1";
"CertDumpECprime192v1" = "ANSI X9.62 elliptic curve prime192v1 (aka secp192r1, NIST P-192)";
"CertDumpECprime192v2" = "ANSI X9.62 elliptic curve prime192v2";
"CertDumpECprime192v3" = "ANSI X9.62 elliptic curve prime192v3";
"CertDumpECprime239v1" = "ANSI X9.62 elliptic curve prime239v1";
"CertDumpECprime239v2" = "ANSI X9.62 elliptic curve prime239v2";
"CertDumpECprime239v3" = "ANSI X9.62 elliptic curve prime239v3";
"CertDumpECprime256v1" = "ANSI X9.62 elliptic curve prime256v1 (aka secp256r1, NIST P-256)";
"CertDumpECsecp112r1" = "SECG elliptic curve secp112r1";
"CertDumpECsecp112r2" = "SECG elliptic curve secp112r2";
"CertDumpECsecp128r1" = "SECG elliptic curve secp128r1";
"CertDumpECsecp128r2" = "SECG elliptic curve secp128r2";
"CertDumpECsecp160k1" = "SECG elliptic curve secp160k1";
"CertDumpECsecp160r1" = "SECG elliptic curve secp160r1";
"CertDumpECsecp160r2" = "SECG elliptic curve secp160r2";
"CertDumpECsecp192k1" = "SECG elliptic curve secp192k1";
"CertDumpECsecp224k1" = "SECG elliptic curve secp224k1";
"CertDumpECsecp224r1" = "SECG elliptic curve secp224r1 (aka NIST P-224)";
"CertDumpECsecp256k1" = "SECG elliptic curve secp256k1";
"CertDumpECsecp384r1" = "SECG elliptic curve secp384r1 (aka NIST P-384)";
"CertDumpECsecp521r1" = "SECG elliptic curve secp521r1 (aka NIST P-521)";
"CertDumpECc2pnb163v1" = "ANSI X9.62 elliptic curve c2pnb163v1";
"CertDumpECc2pnb163v2" = "ANSI X9.62 elliptic curve c2pnb163v2";
"CertDumpECc2pnb163v3" = "ANSI X9.62 elliptic curve c2pnb163v3";
"CertDumpECc2pnb176v1" = "ANSI X9.62 elliptic curve c2pnb176v1";
"CertDumpECc2tnb191v1" = "ANSI X9.62 elliptic curve c2tnb191v1";
"CertDumpECc2tnb191v2" = "ANSI X9.62 elliptic curve c2tnb191v2";
"CertDumpECc2tnb191v3" = "ANSI X9.62 elliptic curve c2tnb191v3";
"CertDumpECc2onb191v4" = "ANSI X9.62 elliptic curve c2onb191v4";
"CertDumpECc2onb191v5" = "ANSI X9.62 elliptic curve c2onb191v5";
"CertDumpECc2pnb208w1" = "ANSI X9.62 elliptic curve c2pnb208w1";
"CertDumpECc2tnb239v1" = "ANSI X9.62 elliptic curve c2tnb239v1";
"CertDumpECc2tnb239v2" = "ANSI X9.62 elliptic curve c2tnb239v2";
"CertDumpECc2tnb239v3" = "ANSI X9.62 elliptic curve c2tnb239v3";
"CertDumpECc2onb239v4" = "ANSI X9.62 elliptic curve c2onb239v4";
"CertDumpECc2onb239v5" = "ANSI X9.62 elliptic curve c2onb239v5";
"CertDumpECc2pnb272w1" = "ANSI X9.62 elliptic curve c2pnb272w1";
"CertDumpECc2pnb304w1" = "ANSI X9.62 elliptic curve c2pnb304w1";
"CertDumpECc2tnb359v1" = "ANSI X9.62 elliptic curve c2tnb359v1";
"CertDumpECc2pnb368w1" = "ANSI X9.62 elliptic curve c2pnb368w1";
"CertDumpECc2tnb431r1" = "ANSI X9.62 elliptic curve c2tnb431r1";
"CertDumpECsect113r1" = "SECG elliptic curve sect113r1";
"CertDumpECsect113r2" = "SECG elliptic curve sect113r2";
"CertDumpECsect131r1" = "SECG elliptic curve sect131r1";
"CertDumpECsect131r2" = "SECG elliptic curve sect131r2";
"CertDumpECsect163k1" = "SECG elliptic curve sect163k1 (aka NIST K-163)";
"CertDumpECsect163r1" = "SECG elliptic curve sect163r1";
"CertDumpECsect163r2" = "SECG elliptic curve sect163r2 (aka NIST B-163)";
"CertDumpECsect193r1" = "SECG elliptic curve sect193r1";
"CertDumpECsect193r2" = "SECG elliptic curve sect193r2";
"CertDumpECsect233k1" = "SECG elliptic curve sect233k1 (aka NIST K-233)";
"CertDumpECsect233r1" = "SECG elliptic curve sect233r1 (aka NIST B-233)";
"CertDumpECsect239k1" = "SECG elliptic curve sect239k1";
"CertDumpECsect283k1" = "SECG elliptic curve sect283k1 (aka NIST K-283)";
"CertDumpECsect283r1" = "SECG elliptic curve sect283r1 (aka NIST B-283)";
"CertDumpECsect409k1" = "SECG elliptic curve sect409k1 (aka NIST K-409)";
"CertDumpECsect409r1" = "SECG elliptic curve sect409r1 (aka NIST B-409)";
"CertDumpECsect571k1" = "SECG elliptic curve sect571k1 (aka NIST K-571)";
"CertDumpECsect571r1" = "SECG elliptic curve sect571r1 (aka NIST B-571)";
"CertDumpRawBytesHeader" = "Size: %S Bytes / %S Bits";
"VerifySSLClient_p" = "Client";
"VerifySSLServer_p" = "Server";
"VerifySSLStepUp_p" = "Step-up";
"VerifySSLCA_p" = "SSL CA";
"VerifyEmailSigner_p" = "Sign";
"VerifyEmailRecip_p" = "Encrypt";
"VerifyProtectObjSign_p" = "Protected Object Signer";
"VerifyObjSign_p" = "Object Signer";
"VerifyUserImport_p" = "User Import";
"VerifyCAVerifier_p" = "CA Verifier";
"VerifyStatusResponder_p" = "Status Responder";
"VerifyAnyCA_p" = "CA";
"VerifiedTrue" = "true";
"VerifiedFalse" = "false";
"PK11BadPassword" = "The password entered was incorrect.";
"SuccessfulP12Backup" = "Successfully backed up your security certificate(s) and private key(s).";
"SuccessfulP12Restore" = "Successfully restored your security certificate(s) and private key(s).";
"PKCS12PasswordInvalid" = "Could not decode PKCS #12 file.  Perhaps the password you entered was incorrect?";
"PKCS12DecodeErr" = "Failed to decode the file.  Either it is not in PKCS #12 format, has been corrupted, or the password you entered was incorrect.";
"PKCS12UnknownErrRestore" = "Failed to restore the PKCS #12 file for unknown reasons.";
"PKCS12UnknownErrBackup" = "Failed to create the PKCS #12 backup file for unknown reasons.";
"PKCS12UnknownErr" = "The PKCS #12 operation failed for unknown reasons.";
"PKCS12InfoNoSmartcardBackup" = "It is not possible to back up certificates from a hardware security device such as a smart card.";
"PKCS12DupData" = "The certificate and private key already exist on the security device.";
"AddModulePrompt" = "Are you sure you want to install this security module?";
"AddModuleName" = "Module Name: %S";
"AddModulePath" = "Path: %S";
"AddModuleSuccess" = "A new security module has been installed";
"AddModuleFailure" = "Unable to add module";
"AddModuleDup" = "Security Module already exists";
"DelModuleBadName" = "Invalid module name.";
"DelModuleWarning" = "Are you sure you want to delete this security module?";
"DelModuleError" = "Unable to delete module";
"DelModuleIntSuccess" = "Internal security module successfully deleted";
"DelModuleExtSuccess" = "External security module successfully deleted";
"ForcedBackup1" = "You should make a password-protected backup copy of your new security certificate and its associated private key.";
"ForcedBackup2" = "If you ever lose access to your private key by forgetting your personal security password, or by experiencing file corruption, you can restore this private key and certificate from this backup copy.";
"ForcedBackup3" = "To make a copy, click OK. If possible, you should save your backup copy on a floppy disk that you keep in a safe location.";
"UnknownCertIssuer" = "(Unknown Issuer)";
"UnknownCertOrg" = "(Unknown Organization)";
"AVATemplate" = "%S = %S";

"PSMERR_SSL_Disabled" = "Can’t connect securely because the SSL protocol has been disabled.";
"PSMERR_SSL2_Disabled" = "Can’t connect securely because the site uses an older, insecure version of the SSL protocol.";
"PSMERR_HostReusedIssuerSerial" = "You have received an invalid certificate.  Please contact the server administrator or email correspondent and give them the following information:\n\nYour certificate contains the same serial number as another certificate issued by the certificate authority.  Please get a new certificate containing a unique serial number.";

"SSLConnectionErrorPrefix" = "An error occurred during a connection to %S.";

"certErrorIntro" = "%S uses an invalid security certificate.";

"certErrorTrust_SelfSigned" = "The certificate is not trusted because it is self-signed.";
"certErrorTrust_UnknownIssuer" = "The certificate is not trusted because the issuer certificate is unknown.";
"certErrorTrust_CaInvalid" = "The certificate is not trusted because it was issued by an invalid CA certificate.";
"certErrorTrust_Issuer" = "The certificate is not trusted because the issuer certificate is not trusted.";
"certErrorTrust_ExpiredIssuer" = "The certificate is not trusted because the issuer certificate has expired.";
"certErrorTrust_Untrusted" = "The certificate does not come from a trusted source.";

"certErrorMismatch" = "The certificate is not valid for the name %S.";
/* # LOCALIZATION NOTE (certErrorMismatchSingle2): Do not translate <a id=\"cert_domain_link\" title=\"%1$S\">%1$S</a> */
"certErrorMismatchSingle2" = "The certificate is only valid for <a id=\"cert_domain_link\" title=\"%1$S\">%1$S</a>";
"certErrorMismatchSinglePlain" = "The certificate is only valid for %S";
"certErrorMismatchMultiple" = "The certificate is only valid for the following names:";
"certErrorMismatchNoNames" = "The certificate is not valid for any server names.";

"certErrorExpired" = "The certificate expired on %S.";
"certErrorNotYetValid" = "The certificate will not be valid until %S.";

"certErrorCodePrefix" = "(Error code: %S)";

"CertInfoIssuedFor" = "Issued to:";
"CertInfoIssuedBy" = "Issued by:";
"CertInfoValid" = "Valid";
"CertInfoFrom" = "from";
"CertInfoTo" = "to";
"CertInfoPurposes" = "Purposes";
"CertInfoEmail" = "Email";
"CertInfoStoredIn" = "Stored in:";
"P12DefaultNickname" = "Imported Certificate";
"CrlImportFailure1x" = "The application cannot import the Certificate Revocation List (CRL).";
"CrlImportFailureExpired" = "A more recent version of this CRL is available.";
"CrlImportFailureBadSignature" = "CRL has an invalid Signature.";
"CrlImportFailureInvalid" = "New CRL has an invalid format.";
"CrlImportFailureOld" = "New CRL is older than the current one.";
"CrlImportFailureNotYetValid" = "The CRL is not yet valid. You might want to check your system clock.";
"CrlImportFailureNetworkProblem" = "Download of the CRL failed due to Network problems.";
"CrlImportFailureReasonUnknown" = "Error Importing CRL to local Database. Error Code: ";
"CrlImportFailure2" = "Please ask your system administrator for assistance.";
"NSSInitProblemX" = "Could not initialize the application’s security component. The most likely cause is problems with files in your application’s profile directory. Please check that this directory has no read/write restrictions and your hard disk is not full or close to full. It is recommended that you exit the application and fix the problem. If you continue to use this session, you might see incorrect application behaviour when accessing security features.";
"ProfileSwitchSocketsStillActive" = "The operation can not be completed because of an internal failure. A secure network communication has not been cleaned up correctly.";
"ProfileSwitchCryptoUIActive" = "This operation is impossible at the current time. Please complete the operation that requests your attention in one of the other open windows.";
"VerifyExpired" = "<Expired>";
"VerifyRevoked" = "<Revoked>";
"VerifyNotTrusted" = "<Not Trusted>";
"VerifyIssuerNotTrusted" = "<Issuer Not Trusted>";
"VerifyIssuerUnknown" = "<Issuer Unknown>";
"VerifyInvalidCA" = "<Invalid CA>";
"VerifyUnknown" = "<Unknown>";
"CertUser" = "Your Cert";
"CertCA" = "CA (Certificate Authority)";
"CertSSL" = "SSL Server";
"CertEmail" = "Peer S/MIME";
"CertUnknown" = "Unknown";
"CertNoNickname" = "(no nickname)";
"CertNoEmailAddress" = "(no email address)";
"NicknameExpired" = "(expired)";
"NicknameNotYetValid" = "(not yet valid)";
"CaCertExists" = "This certificate is already installed as a certificate authority.";
"NotACACert" = "This is not a certificate authority certificate, so it can’t be imported into the certificate authority list.";
"NotImportingUnverifiedCert" = "This certificate can’t be verified and will not be imported. The certificate issuer might be unknown or untrusted, the certificate might have expired or been revoked, or the certificate might not have been approved.";
"UserCertIgnoredNoPrivateKey" = "This personal certificate can’t be installed because you do not own the corresponding private key which was created when the certificate was requested.";
"UserCertImported" = "Your personal certificate has been installed. You should keep a backup copy of this certificate.";
"CertOrgUnknown" = "(Unknown)";
"CertNotStored" = "(Not Stored)";
"CertExceptionPermanent" = "Permanent";
"CertExceptionTemporary" = "Temporary";
